brew 'asdf'
brew 'autoconf'
brew 'bash'
brew 'bat'
brew 'binutils', link: true
brew 'coreutils'
brew 'curl'
brew 'diff-so-fancy'
brew 'diffutils'
brew 'exa'
brew 'fd'
brew 'findutils'
brew 'fish'
brew 'gawk'
brew 'gdb'
brew 'git'
brew 'glib'
brew 'gnu-getopt', link: true
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-units'
brew 'gnu-which'
brew 'gnupg'
brew 'gnutls'
brew 'grep'
brew 'guile'
brew 'gzip'
brew 'htop'
brew 'jq'
brew 'less'
brew 'libfido2'
brew 'libtool'
brew 'libvterm'
brew 'm-cli'
brew 'make'
brew 'mas'
brew 'mpfr'
brew 'neovim'
brew 'netcat'
brew 'openssh'
brew 'openssl@1.1'
brew 'parallel'
brew 'perl'
brew 'pinentry-mac'
brew 'proctools'
brew 'python@2'
brew 'python@3.8'
brew 'ranger'
brew 'rcm'
brew 'ripgrep'
brew 'rsync'
brew 'shellcheck'
brew 'shfmt'
brew 'tmux'
brew 'unzip'
brew 'vim'
brew 'watch'
brew 'wdiff'
brew 'wget'
brew 'yamllint'
cask '1password'
cask 'backblaze'
cask 'betterzipql'
cask 'daisydisk'
cask 'dropbox'
cask 'encryptme'
cask 'firefox'
cask 'flash-player'
cask 'flux'
cask 'font-cascadia'
cask 'google-chrome'
cask 'iterm2'
cask 'kaleidoscope'
cask 'monodraw'
cask 'moom'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookase'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'
cask 'webpquicklook'
mas 'Dato', id: 1470584107
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Xcode', id: 497799835
mas 'iMovie', id: 408981434
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'thoughtbot/formulae'

Dir.glob(File.join(File.expand_path('~/.config/dotfile'), 'Brewfile.*')) do |path|
  instance_eval(File.read(path))
end
