tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "neovim/neovim"
tap "nodenv/nodenv"
tap "thoughtbot/formulae"
brew "autoconf"
brew "bash"
brew "binutils", link: true
brew "python"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "diffutils"
brew "exa"
brew "fd"
brew "findutils"
brew "fish"
brew "mpfr"
brew "gawk"
brew "gdb"
brew "git"
brew "gnu-getopt", link: true
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-units"
brew "gnu-which"
brew "gnutls"
brew "go"
brew "grep"
brew "gzip"
brew "htop"
brew "libtool"
brew "imagemagick"
brew "jo"
brew "jq"
brew "less"
brew "libqalculate"
brew "llvm"
brew "m-cli"
brew "make"
brew "mas"
brew "neovim"
brew "netcat"
brew "ngrep"
brew "nmap"
brew "node"
brew "node-build"
brew "nodenv"
brew "openssh"
brew "parallel"
brew "perl"
brew "proctools"
brew "python@2", link: false
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "rbenv-aliases"
brew "rbenv-default-gems"
brew "ripgrep"
brew "rsync"
brew "shellcheck"
brew "shfmt"
brew "tmux"
brew "unzip"
brew "vim"
brew "watch"
brew "wdiff"
brew "wget"
brew "nodenv/nodenv/nodenv-aliases"
brew "nodenv/nodenv/nodenv-default-packages"
brew "thoughtbot/formulae/rcm"
cask "1password"
cask "backblaze"
cask "betterzipql"
cask "chromium"
cask "daisydisk"
cask "docker"
cask "dropbox"
cask "encryptme"
cask "firefox"
cask "firefox-developer-edition"
cask "flash-player"
cask "flux"
cask "font-meslo-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "kaleidoscope"
cask "moom"
cask "ngrok"
cask "paw"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "slack"
cask "spotify"
cask "suspicious-package"
cask "textual"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
