brew 'asdf'
brew 'bash'
brew 'bat'
brew 'binutils', link: true
brew 'coreutils'
brew 'curl'
brew 'diff-so-fancy'
brew 'diffutils'
brew 'exa'
brew 'fd'
brew 'findutils'
brew 'fish'
brew 'fzf'
brew 'gawk'
brew 'gdb'
brew 'git'
brew 'glib'
brew 'gnu-getopt', link: true
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-units'
brew 'gnu-which'
brew 'gnupg'
brew 'gnutls'
brew 'grep'
brew 'gzip'
brew 'jq'
brew 'less'
brew 'libvterm'
brew 'make'
brew 'neovim'
brew 'netcat'
brew 'openssh'
brew 'openssl@1.1'
brew 'parallel'
brew 'perl'
brew 'proctools'
brew 'python@3'
brew 'ranger'
brew 'readline'
brew 'ripgrep'
brew 'rsync'
brew 'shellcheck'
brew 'shfmt'
brew 'starship'
brew 'thoughtbot/formulae/rcm'
brew 'tmux'
brew 'unzip'
brew 'vim'
brew 'watch'
brew 'wdiff'
brew 'wget'
brew 'yamllint'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'thoughtbot/formulae'

Dir.glob(File.join(File.expand_path('~/.config/dotfile'), 'Brewfile.*')) do |path|
  instance_eval(File.read(path))
end
