brew "bash"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "findutils"
brew "gawk"
brew "git"
brew "gnu-getopt", link: true
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-units"
brew "gnu-which"
brew "gnupg"
brew "grep"
brew "gzip"
brew "less"
brew "make"
brew "openssh"
brew "openssl@1.1"
brew "proctools"
brew "watch"
