brew "comby"
brew "direnv"
brew "dlv"
brew "dotnet"
brew "go"
brew "golangci-lint"
brew "just"
brew "lefthook"
brew "node"
brew "ruby"
brew "rust"
brew "selene"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "vale"
brew "yamllint"
