tap "homebrew/cask"
tap "homebrew/cask-fonts"

cask "1password"
cask "backblaze"
cask "daisydisk"
cask "docker"
cask "dropbox"
cask "encryptme"
cask "firefox"
cask "flash-player"
cask "font-caskaydia-cove-nerd-font"
cask "google-chrome"
cask "kaleidoscope"
cask "monodraw"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"

mas "Dato", id: 1470584107
mas "Microsoft Remote Desktop", id: 1295203466
